SETUP.org
#+TITLE: Lisp Dialect Showcase
#+AUTHOR: Jason Walsh <j@wal.sh>
#+DATE: April 14, 2025
#+PROPERTY: header-args :padline yes :comments both
#+OPTIONS: toc:3 num:t 

* Introduction

This repository contains implementations of common programming problems in various Lisp dialects.
Each implementation demonstrates the unique features and syntax of that particular Lisp variant.

* Problems

We showcase the following small programs in each Lisp dialect:

1. Fibonacci sequence
2. Factorial calculation
3. Prime number generation
4. FizzBuzz
5. Quicksort implementation

* Common Lisp

** Fibonacci

#+BEGIN_SRC lisp :tangle src/common-lisp/fibonacci.lisp :mkdirp yes
(defpackage :cl-fibonacci
  (:use :cl)
  (:export :fib-recursive :fib-iterative :fib-memo))

(in-package :cl-fibonacci)

;; Recursive implementation
(defun fib-recursive (n)
  "Calculate the nth Fibonacci number recursively."
  (cond ((= n 0) 0)
        ((= n 1) 1)
        (t (+ (fib-recursive (- n 1))
              (fib-recursive (- n 2))))))

;; Iterative implementation
(defun fib-iterative (n)
  "Calculate the nth Fibonacci number iteratively."
  (if (< n 2)
      n
      (let ((a 0) (b 1))
        (dotimes (i (- n 1) b)
          (let ((temp (+ a b)))
            (setf a b)
            (setf b temp))))))

;; Memoization implementation
(let ((memo (make-hash-table)))
  (defun fib-memo (n)
    "Calculate the nth Fibonacci number using memoization."
    (or (gethash n memo)
        (setf (gethash n memo)
              (if (< n 2)
                  n
                  (+ (fib-memo (- n 1))
                     (fib-memo (- n 2))))))))

;; Example usage
(defun run-examples ()
  (format t "Fibonacci of 10 (recursive): ~a~%" (fib-recursive 10))
  (format t "Fibonacci of 10 (iterative): ~a~%" (fib-iterative 10))
  (format t "Fibonacci of 10 (memoized): ~a~%" (fib-memo 10)))
#+END_SRC

** Factorial

#+BEGIN_SRC lisp :tangle src/common-lisp/factorial.lisp :mkdirp yes
(defpackage :cl-factorial
  (:use :cl)
  (:export :factorial-recursive :factorial-iterative :factorial-tail))

(in-package :cl-factorial)

;; Recursive implementation
(defun factorial-recursive (n)
  "Calculate factorial recursively."
  (if (<= n 1)
      1
      (* n (factorial-recursive (- n 1)))))

;; Iterative implementation
(defun factorial-iterative (n)
  "Calculate factorial iteratively."
  (let ((result 1))
    (dotimes (i n result)
      (setf result (* result (1+ i))))))

;; Tail-recursive implementation
(defun factorial-tail (n &optional (acc 1))
  "Calculate factorial using tail recursion."
  (if (<= n 1)
      acc
      (factorial-tail (- n 1) (* acc n))))

;; Example usage
(defun run-examples ()
  (format t "Factorial of 5 (recursive): ~a~%" (factorial-recursive 5))
  (format t "Factorial of 5 (iterative): ~a~%" (factorial-iterative 5))
  (format t "Factorial of 5 (tail-recursive): ~a~%" (factorial-tail 5)))
#+END_SRC

** Prime Number Generator

#+BEGIN_SRC lisp :tangle src/common-lisp/primes.lisp :mkdirp yes
(defpackage :cl-primes
  (:use :cl)
  (:export :primep :sieve-of-eratosthenes :primes-up-to))

(in-package :cl-primes)

;; Function to check if a number is prime
(defun primep (n)
  "Check if n is a prime number."
  (when (> n 1)
    (loop for i from 2 to (isqrt n)
          never (zerop (mod n i)))))

;; Sieve of Eratosthenes implementation
(defun sieve-of-eratosthenes (max)
  "Generate all primes up to max using Sieve of Eratosthenes."
  (let ((sieve (make-array (1+ max) :initial-element t)))
    (setf (aref sieve 0) nil
          (aref sieve 1) nil)
    (loop for i from 2 to (isqrt max)
          when (aref sieve i)
          do (loop for j from (* i i) to max by i
                   do (setf (aref sieve j) nil)))
    (loop for i from 2 to max
          when (aref sieve i)
          collect i)))

;; Function to generate primes up to n
(defun primes-up-to (n)
  "Generate a list of primes up to n."
  (loop for i from 2 to n
        when (primep i)
        collect i))

;; Example usage
(defun run-examples ()
  (format t "Primes up to 20: ~a~%" (primes-up-to 20))
  (format t "Primes up to 20 (sieve): ~a~%" (sieve-of-eratosthenes 20))
  (format t "Is 17 prime? ~a~%" (primep 17))
  (format t "Is 15 prime? ~a~%" (primep 15)))
#+END_SRC

** FizzBuzz

#+BEGIN_SRC lisp :tangle src/common-lisp/fizzbuzz.lisp :mkdirp yes
(defpackage :cl-fizzbuzz
  (:use :cl)
  (:export :fizzbuzz))

(in-package :cl-fizzbuzz)

;; FizzBuzz implementation
(defun fizzbuzz (n)
  "Print FizzBuzz from 1 to n."
  (loop for i from 1 to n
        do (format t "~a~%"
                  (cond ((zerop (mod i 15)) "FizzBuzz")
                        ((zerop (mod i 3)) "Fizz")
                        ((zerop (mod i 5)) "Buzz")
                        (t i)))))

;; Functional implementation returning a list
(defun fizzbuzz-list (n)
  "Return a list of FizzBuzz values from 1 to n."
  (loop for i from 1 to n
        collect (cond ((zerop (mod i 15)) "FizzBuzz")
                     ((zerop (mod i 3)) "Fizz")
                     ((zerop (mod i 5)) "Buzz")
                     (t i))))

;; Example usage
(defun run-examples ()
  (format t "FizzBuzz (1-20):~%")
  (fizzbuzz 20)
  (format t "~%FizzBuzz as list (1-20): ~a~%" (fizzbuzz-list 20)))
#+END_SRC

** Quicksort

#+BEGIN_SRC lisp :tangle src/common-lisp/quicksort.lisp :mkdirp yes
(defpackage :cl-quicksort
  (:use :cl)
  (:export :quicksort :quicksort-functional))

(in-package :cl-quicksort)

;; Functional implementation of quicksort
(defun quicksort-functional (list)
  "Sort a list using functional quicksort."
  (if (or (null list) (null (cdr list)))
      list
      (let* ((pivot (car list))
             (rest (cdr list))
             (lesser (remove-if-not (lambda (x) (< x pivot)) rest))
             (greater (remove-if-not (lambda (x) (>= x pivot)) rest)))
        (append (quicksort-functional lesser)
                (list pivot)
                (quicksort-functional greater)))))

;; Destructive in-place quicksort
(defun quicksort (sequence &key (start 0) (end (length sequence)) (predicate #'<))
  "Sort a sequence in-place using quicksort."
  (when (> (- end start) 1)
    (let ((pivot-pos (partition sequence start end predicate)))
      (quicksort sequence :start start :end pivot-pos :predicate predicate)
      (quicksort sequence :start (1+ pivot-pos) :end end :predicate predicate)))
  sequence)

;; Helper function for in-place quicksort
(defun partition (sequence start end predicate)
  (let ((pivot (elt sequence start))
        (i (1+ start)))
    (loop for j from (1+ start) below end
          when (funcall predicate (elt sequence j) pivot)
          do (progn
               (rotatef (elt sequence i) (elt sequence j))
               (incf i)))
    (rotatef (elt sequence start) (elt sequence (1- i)))
    (1- i)))

;; Example usage
(defun run-examples ()
  (let ((list1 '(3 1 4 1 5 9 2 6 5 3 5))
        (list2 '(3 1 4 1 5 9 2 6 5 3 5))
        (vector1 #(3 1 4 1 5 9 2 6 5 3 5)))
    (format t "Original list: ~a~%" list1)
    (format t "Functional quicksort: ~a~%" (quicksort-functional list1))
    (format t "Original list unchanged: ~a~%" list1)
    (format t "Destructive quicksort (list): ~a~%" (quicksort list2))
    (format t "Destructive quicksort (vector): ~a~%" (quicksort vector1))))
#+END_SRC

* Clojure

** Fibonacci

#+BEGIN_SRC clojure :tangle src/clojure/fibonacci.clj :mkdirp yes
(ns clojure.fibonacci
  (:gen-class))

;; Recursive implementation
(defn fib-recursive [n]
  (cond 
    (= n 0) 0
    (= n 1) 1
    :else (+ (fib-recursive (- n 1))
             (fib-recursive (- n 2)))))

;; Lazy sequence implementation
(def fibs
  (lazy-cat [0 1] (map + fibs (rest fibs))))

(defn fib-lazy [n]
  (nth fibs n))

;; Tail-recursive implementation
(defn fib-tail
  ([n] (fib-tail n 0 1))
  ([n a b]
   (if (zero? n)
     a
     (recur (dec n) b (+ a b)))))

;; Example usage
(defn run-examples []
  (println "Fibonacci of 10 (recursive):" (fib-recursive 10))
  (println "Fibonacci of 10 (lazy):" (fib-lazy 10))
  (println "Fibonacci of 10 (tail):" (fib-tail 10))
  (println "First 10 Fibonacci numbers:" (take 10 fibs)))

(defn -main []
  (run-examples))
#+END_SRC

** Factorial

#+BEGIN_SRC clojure :tangle src/clojure/factorial.clj :mkdirp yes
(ns clojure.factorial
  (:gen-class))

;; Recursive implementation
(defn factorial-recursive [n]
  (if (<= n 1)
    1
    (* n (factorial-recursive (dec n)))))

;; Tail-recursive implementation
(defn factorial-tail
  ([n] (factorial-tail n 1))
  ([n acc]
   (if (<= n 1)
     acc
     (recur (dec n) (* acc n)))))

;; Using reduce
(defn factorial-reduce [n]
  (reduce * (range 1 (inc n))))

;; Example usage
(defn run-examples []
  (println "Factorial of 5 (recursive):" (factorial-recursive 5))
  (println "Factorial of 5 (tail):" (factorial-tail 5))
  (println "Factorial of 5 (reduce):" (factorial-reduce 5)))

(defn -main []
  (run-examples))
#+END_SRC

** Prime Number Generator

#+BEGIN_SRC clojure :tangle src/clojure/primes.clj :mkdirp yes
(ns clojure.primes
  (:gen-class))

;; Check if a number is prime
(defn prime? [n]
  (cond
    (<= n 1) false
    (= n 2) true
    (even? n) false
    :else (not-any? #(zero? (mod n %))
                    (range 3 (inc (Math/sqrt n)) 2))))

;; Sieve of Eratosthenes
(defn sieve-of-eratosthenes [n]
  (let [n (int n)]
    (if (<= n 1)
      []
      (let [sqrt-n (int (Math/sqrt n))
            sieve (boolean-array (inc n) true)]
        (aset sieve 0 false)
        (aset sieve 1 false)
        (doseq [i (range 2 (inc sqrt-n))]
          (when (aget sieve i)
            (doseq [j (range (* i i) (inc n) i)]
              (aset sieve j false))))
        (filter #(aget sieve %) (range 2 (inc n)))))))

;; Generate primes up to n
(defn primes-up-to [n]
  (filter prime? (range 2 (inc n))))

;; Example usage
(defn run-examples []
  (println "Primes up to 20:" (primes-up-to 20))
  (println "Primes up to 20 (sieve):" (sieve-of-eratosthenes 20))
  (println "Is 17 prime?" (prime? 17))
  (println "Is 15 prime?" (prime? 15)))

(defn -main []
  (run-examples))
#+END_SRC

** FizzBuzz

#+BEGIN_SRC clojure :tangle src/clojure/fizzbuzz.clj :mkdirp yes
(ns clojure.fizzbuzz
  (:gen-class))

;; FizzBuzz using cond
(defn fizzbuzz-cond [n]
  (map (fn [i]
         (cond
           (zero? (mod i 15)) "FizzBuzz"
           (zero? (mod i 3)) "Fizz"
           (zero? (mod i 5)) "Buzz"
           :else i))
       (range 1 (inc n))))

;; FizzBuzz using pattern matching
(defn fizzbuzz-match [n]
  (for [i (range 1 (inc n))]
    (condp #(zero? (mod %2 %1)) i
      15 "FizzBuzz"
      3 "Fizz"
      5 "Buzz"
      i)))

;; FizzBuzz using case with remainder vector
(defn fizzbuzz-case [n]
  (for [i (range 1 (inc n))
        :let [div3 (zero? (mod i 3))
              div5 (zero? (mod i 5))]]
    (case [div3 div5]
      [true true] "FizzBuzz"
      [true false] "Fizz"
      [false true] "Buzz"
      i)))

;; Example usage
(defn run-examples []
  (println "FizzBuzz (1-20) using cond:")
  (doseq [item (fizzbuzz-cond 20)]
    (println item))
  (println "\nFizzBuzz (1-20) using pattern matching:")
  (println (fizzbuzz-match 20)))

(defn -main []
  (run-examples))
#+END_SRC

** Quicksort

#+BEGIN_SRC clojure :tangle src/clojure/quicksort.clj :mkdirp yes
(ns clojure.quicksort
  (:gen-class))

;; Functional implementation of quicksort
(defn quicksort [coll]
  (if (empty? coll)
    []
    (let [pivot (first coll)
          rest-coll (rest coll)]
      (concat (quicksort (filter #(< % pivot) rest-coll))
              [pivot]
              (quicksort (filter #(>= % pivot) rest-coll))))))

;; Using partition
(defn quicksort-partition [coll]
  (if (or (empty? coll) (= 1 (count coll)))
    coll
    (let [pivot (first coll)
          parts (group-by #(compare % pivot) (rest coll))]
      (concat (quicksort-partition (get parts -1 []))
              [pivot]
              (quicksort-partition (get parts 1 []))
              (quicksort-partition (get parts 0 []))))))

;; Example usage
(defn run-examples []
  (let [numbers [3 1 4 1 5 9 2 6 5 3 5]]
    (println "Original collection:" numbers)
    (println "Quicksort:" (quicksort numbers))
    (println "Quicksort with partition:" (quicksort-partition numbers))))

(defn -main []
  (run-examples))
#+END_SRC

* Scheme

** Fibonacci

#+BEGIN_SRC scheme :tangle src/scheme/fibonacci.scm :mkdirp yes
;; Recursive implementation
(define (fib-recursive n)
  (cond ((= n 0) 0)
        ((= n 1) 1)
        (else (+ (fib-recursive (- n 1))
                (fib-recursive (- n 2))))))

;; Tail-recursive implementation
(define (fib-tail n)
  (define (fib-iter a b count)
    (if (= count 0)
        a
        (fib-iter b (+ a b) (- count 1))))
  (fib-iter 0 1 n))

;; Continuation-passing style
(define (fib-cps n k)
  (cond ((= n 0) (k 0))
        ((= n 1) (k 1))
        (else (fib-cps (- n 1)
                      (lambda (v1)
                        (fib-cps (- n 2)
                               (lambda (v2)
                                 (k (+ v1 v2)))))))))

(define (fib n)
  (fib-cps n (lambda (x) x)))

;; Example usage
(define (run-examples)
  (display "Fibonacci of 10 (recursive): ")
  (display (fib-recursive 10))
  (newline)
  (display "Fibonacci of 10 (tail-recursive): ")
  (display (fib-tail 10))
  (newline)
  (display "Fibonacci of 10 (CPS): ")
  (display (fib 10))
  (newline))

(run-examples)
#+END_SRC

** Factorial

#+BEGIN_SRC scheme :tangle src/scheme/factorial.scm :mkdirp yes
;; Recursive implementation
(define (factorial-recursive n)
  (if (<= n 1)
      1
      (* n (factorial-recursive (- n 1)))))

;; Tail-recursive implementation
(define (factorial-tail n)
  (define (fact-iter product counter max-count)
    (if (> counter max-count)
        product
        (fact-iter (* counter product)
                  (+ counter 1)
                  max-count)))
  (fact-iter 1 1 n))

;; Example usage
(define (run-examples)
  (display "Factorial of 5 (recursive): ")
  (display (factorial-recursive 5))
  (newline)
  (display "Factorial of 5 (tail-recursive): ")
  (display (factorial-tail 5))
  (newline))

(run-examples)
#+END_SRC

