SETUP.org
** Prime Number Generator

#+BEGIN_SRC scheme :tangle src/scheme/primes.scm :mkdirp yes
;; Helper function: square root
(define (square x) (* x x))

;; Check if a number is prime
(define (prime? n)
  (define (smallest-divisor n)
    (find-divisor n 2))
  (define (find-divisor n test-divisor)
    (cond ((> (square test-divisor) n) n)
          ((divides? test-divisor n) test-divisor)
          (else (find-divisor n (+ test-divisor 1)))))
  (define (divides? a b)
    (= (remainder b a) 0))
  (and (> n 1) (= n (smallest-divisor n))))

;; Generate primes up to n
(define (primes-up-to n)
  (define (iter i result)
    (cond ((> i n) (reverse result))
          ((prime? i) (iter (+ i 1) (cons i result)))
          (else (iter (+ i 1) result))))
  (iter 2 '()))

;; Sieve of Eratosthenes (using lists)
(define (sieve-of-eratosthenes n)
  (define (sieve numbers)
    (if (null? numbers)
        '()
        (let ((p (car numbers)))
          (cons p (sieve (filter
                         (lambda (x) (not (= 0 (remainder x p))))
                         (cdr numbers)))))))
  (sieve (range 2 n)))

;; Helper: generate a range of numbers
(define (range start end)
  (if (> start end)
      '()
      (cons start (range (+ start 1) end))))

;; Example usage
(define (run-examples)
  (display "Primes up to 20: ")
  (display (primes-up-to 20))
  (newline)
  (display "Primes up to 20 (sieve): ")
  (display (sieve-of-eratosthenes 21))
  (newline)
  (display "Is 17 prime? ")
  (display (prime? 17))
  (newline)
  (display "Is 15 prime? ")
  (display (prime? 15))
  (newline))

(run-examples)
#+END_SRC

** FizzBuzz

#+BEGIN_SRC scheme :tangle src/scheme/fizzbuzz.scm :mkdirp yes
;; Helper: display FizzBuzz for a number
(define (fizzbuzz-number n)
  (cond ((= (remainder n 15) 0) "FizzBuzz")
        ((= (remainder n 3) 0) "Fizz")
        ((= (remainder n 5) 0) "Buzz")
        (else n)))

;; Print FizzBuzz sequence
(define (fizzbuzz n)
  (define (iter i)
    (when (<= i n)
      (display (fizzbuzz-number i))
      (newline)
      (iter (+ i 1))))
  (iter 1))

;; Create a list of FizzBuzz values
(define (fizzbuzz-list n)
  (define (iter i result)
    (if (> i n)
        (reverse result)
        (iter (+ i 1) (cons (fizzbuzz-number i) result))))
  (iter 1 '()))

;; Example usage
(define (run-examples)
  (display "FizzBuzz (1-20):\n")
  (fizzbuzz 20)
  (display "\nFizzBuzz as list (1-20): ")
  (display (fizzbuzz-list 20))
  (newline))

(run-examples)
#+END_SRC

** Quicksort

#+BEGIN_SRC scheme :tangle src/scheme/quicksort.scm :mkdirp yes
;; Quicksort implementation
(define (quicksort lst)
  (if (or (null? lst) (null? (cdr lst)))
      lst
      (let ((pivot (car lst))
            (rest (cdr lst)))
        (append (quicksort (filter (lambda (x) (< x pivot)) rest))
                (list pivot)
                (quicksort (filter (lambda (x) (>= x pivot)) rest))))))

;; Helper: filter a list
(define (filter pred lst)
  (cond ((null? lst) '())
        ((pred (car lst))
         (cons (car lst) (filter pred (cdr lst))))
        (else (filter pred (cdr lst)))))

;; Example usage
(define (run-examples)
  (let ((numbers '(3 1 4 1 5 9 2 6 5 3 5)))
    (display "Original list: ")
    (display numbers)
    (newline)
    (display "Sorted list: ")
    (display (quicksort numbers))
    (newline)))

(run-examples)
#+END_SRC

* Emacs Lisp

** Fibonacci

#+BEGIN_SRC elisp :tangle src/emacs-lisp/fibonacci.el :mkdirp yes
;;; fibonacci.el --- Fibonacci implementations in Emacs Lisp

;;; Commentary:
;; Various implementations of the Fibonacci sequence in Emacs Lisp

;;; Code:

;; Recursive implementation
(defun fib-recursive (n)
  "Calculate the Nth Fibonacci number recursively."
  (cond ((= n 0) 0)
        ((= n 1) 1)
        (t (+ (fib-recursive (- n 1))
              (fib-recursive (- n 2))))))

;; Dynamic programming implementation
(defun fib-dp (n)
  "Calculate the Nth Fibonacci number using dynamic programming."
  (let ((fib-table (make-vector (1+ n) nil)))
    (aset fib-table 0 0)
    (when (> n 0)
      (aset fib-table 1 1)
      (dotimes (i (- n 1))
        (aset fib-table (+ i 2)
              (+ (aref fib-table (+ i 1))
                 (aref fib-table i)))))
    (aref fib-table n)))

;; Memoization using lexical closure
(defun fib-memo-func ()
  "Create a memoized Fibonacci function."
  (let ((memo (make-hash-table)))
    (puthash 0 0 memo)
    (puthash 1 1 memo)
    (lambda (n)
      (or (gethash n memo)
          (puthash n
                   (+ (funcall this (- n 1))
                      (funcall this (- n 2)))
                   memo)))))

(defvar fib-memo (fib-memo-func)
  "Memoized Fibonacci function.")

;; Example usage
(defun run-fibonacci-examples ()
  "Run examples of various Fibonacci implementations."
  (message "Fibonacci of 10 (recursive): %d" (fib-recursive 10))
  (message "Fibonacci of 10 (dynamic programming): %d" (fib-dp 10))
  (message "Fibonacci of 10 (memoized): %d" (funcall fib-memo 10)))

(provide 'fibonacci)
;;; fibonacci.el ends here
#+END_SRC

** Factorial

#+BEGIN_SRC elisp :tangle src/emacs-lisp/factorial.el :mkdirp yes
;;; factorial.el --- Factorial implementations in Emacs Lisp

;;; Commentary:
;; Various implementations of factorial calculation in Emacs Lisp

;;; Code:

;; Recursive implementation
(defun factorial-recursive (n)
  "Calculate factorial of N recursively."
  (if (<= n 1)
      1
    (* n (factorial-recursive (- n 1)))))

;; Iterative implementation
(defun factorial-iterative (n)
  "Calculate factorial of N iteratively."
  (let ((result 1))
    (dotimes (i n result)
      (setq result (* result (1+ i))))))

;; Tail-recursive implementation
(defun factorial-tail (n &optional (acc 1))
  "Calculate factorial of N using tail recursion with accumulator ACC."
  (if (<= n 1)
      acc
    (factorial-tail (1- n) (* acc n))))

;; Example usage
(defun run-factorial-examples ()
  "Run examples of various factorial implementations."
  (message "Factorial of 5 (recursive): %d" (factorial-recursive 5))
  (message "Factorial of 5 (iterative): %d" (factorial-iterative 5))
  (message "Factorial of 5 (tail-recursive): %d" (factorial-tail 5)))

(provide 'factorial)
;;; factorial.el ends here
#+END_SRC

** Prime Number Generator

#+BEGIN_SRC elisp :tangle src/emacs-lisp/primes.el :mkdirp yes
;;; primes.el --- Prime number functions in Emacs Lisp

;;; Commentary:
;; Functions for working with prime numbers in Emacs Lisp

;;; Code:

;; Check if a number is prime
(defun primep (n)
  "Check if N is a prime number."
  (when (> n 1)
    (let ((limit (isqrt n))
          (is-prime t)
          (divisor 2))
      (while (and is-prime (<= divisor limit))
        (when (= (mod n divisor) 0)
          (setq is-prime nil))
        (setq divisor (1+ divisor)))
      is-prime)))

;; Generate primes up to n
(defun primes-up-to (n)
  "Generate a list of primes up to N."
  (let ((result nil))
    (dotimes (i n)
      (let ((num (1+ i)))
        (when (primep num)
          (push num result))))
    (nreverse result)))

;; Sieve of Eratosthenes
(defun sieve-of-eratosthenes (n)
  "Generate primes up to N using the Sieve of Eratosthenes."
  (let ((sieve (make-bool-vector (1+ n) t)))
    ;; 0 and 1 are not prime
    (aset sieve 0 nil)
    (aset sieve 1 nil)
    ;; Mark multiples of each prime as non-prime
    (let ((limit (isqrt n)))
      (dotimes (i limit)
        (let ((num (+ i 2)))
          (when (aref sieve num)
            (let ((j (* num num)))
              (while (<= j n)
                (aset sieve j nil)
                (setq j (+ j num))))))))
    ;; Collect the primes
    (let ((primes nil))
      (dotimes (i (1- n))
        (let ((num (+ i 2)))
          (when (aref sieve num)
            (push num primes))))
      (nreverse primes))))

;; Example usage
(defun run-prime-examples ()
  "Run examples of prime number functions."
  (message "Primes up to 20: %S" (primes-up-to 20))
  (message "Primes up to 20 (sieve): %S" (sieve-of-eratosthenes 20))
  (message "Is 17 prime? %s" (if (primep 17) "Yes" "No"))
  (message "Is 15 prime? %s" (if (primep 15) "Yes" "No")))

(provide 'primes)
;;; primes.el ends here
#+END_SRC

** FizzBuzz

#+BEGIN_SRC elisp :tangle src/emacs-lisp/fizzbuzz.el :mkdirp yes
;;; fizzbuzz.el --- FizzBuzz implementation in Emacs Lisp

;;; Commentary:
;; FizzBuzz implementation in Emacs Lisp

;;; Code:

;; FizzBuzz implementation
(defun fizzbuzz (n)
  "Print FizzBuzz from 1 to N."
  (dotimes (i n)
    (let ((num (1+ i)))
      (message "%s"
               (cond
                ((zerop (mod num 15)) "FizzBuzz")
                ((zerop (mod num 3)) "Fizz")
                ((zerop (mod num 5)) "Buzz")
                (t num))))))

;; Function to return a list of FizzBuzz values
(defun fizzbuzz-list (n)
  "Return a list of FizzBuzz values from 1 to N."
  (let ((result nil))
    (dotimes (i n)
      (let ((num (1+ i)))
        (push
         (cond
          ((zerop (mod num 15)) "FizzBuzz")
          ((zerop (mod num 3)) "Fizz")
          ((zerop (mod num 5)) "Buzz")
          (t num))
         result)))
    (nreverse result)))

;; Example usage
(defun run-fizzbuzz-examples ()
  "Run examples of FizzBuzz functions."
  (message "FizzBuzz (1-20):")
  (fizzbuzz 20)
  (message "\nFizzBuzz as list (1-20): %S" (fizzbuzz-list 20)))

(provide 'fizzbuzz)
;;; fizzbuzz.el ends here
#+END_SRC

