SETUP.org
** Quicksort

#+BEGIN_SRC elisp :tangle src/emacs-lisp/quicksort.el :mkdirp yes
;;; quicksort.el --- Quicksort implementation in Emacs Lisp

;;; Commentary:
;; Quicksort implementation in Emacs Lisp

;;; Code:

;; Quicksort implementation for lists
(defun quicksort-list (list)
  "Sort LIST using quicksort algorithm."
  (if (or (null list) (null (cdr list)))
      list
    (let* ((pivot (car list))
           (rest (cdr list))
           (lesser (cl-remove-if-not (lambda (x) (< x pivot)) rest))
           (greater (cl-remove-if-not (lambda (x) (>= x pivot)) rest)))
      (append (quicksort-list lesser)
              (list pivot)
              (quicksort-list greater)))))

;; Quicksort implementation for vectors
(defun quicksort-vector (vec &optional start end)
  "Sort vector VEC in-place using quicksort from START to END."
  (let ((start (or start 0))
        (end (or end (length vec))))
    (when (> (- end start) 1)
      (let ((pivot-pos (partition vec start end)))
        (quicksort-vector vec start pivot-pos)
        (quicksort-vector vec (1+ pivot-pos) end)))
    vec))

;; Helper function for vector quicksort
(defun partition (vec start end)
  "Partition vector VEC from START to END and return pivot position."
  (let* ((pivot (aref vec start))
         (i (1+ start)))
    (cl-loop for j from (1+ start) below end
             when (< (aref vec j) pivot)
             do (progn
                  (cl-rotatef (aref vec i) (aref vec j))
                  (setq i (1+ i))))
    (cl-rotatef (aref vec start) (aref vec (1- i)))
    (1- i)))

;; Example usage
(defun run-quicksort-examples ()
  "Run examples of quicksort functions."
  (let ((list1 '(3 1 4 1 5 9 2 6 5 3 5))
        (vec1 [3 1 4 1 5 9 2 6 5 3 5]))
    (message "Original list: %S" list1)
    (message "Sorted list: %S" (quicksort-list list1))
    (message "Original vector: %S" vec1)
    (message "Sorted vector: %S" (quicksort-vector (copy-sequence vec1)))))

(provide 'quicksort)
;;; quicksort.el ends here
#+END_SRC

* Racket

** Fibonacci

#+BEGIN_SRC racket :tangle src/racket/fibonacci.rkt :mkdirp yes
#lang racket

;; Recursive implementation
(define (fib-recursive n)
  (cond [(= n 0) 0]
        [(= n 1) 1]
        [else (+ (fib-recursive (- n 1))
                 (fib-recursive (- n 2)))]))

;; Memoization with built-in support
(require racket/memoize)

(define fib-memo
  (memoize
   (λ (n)
     (cond [(= n 0) 0]
           [(= n 1) 1]
           [else (+ (fib-memo (- n 1))
                    (fib-memo (- n 2)))]))))

;; Contract-based implementation
(provide/contract
 [fibonacci (-> exact-nonnegative-integer?
                exact-nonnegative-integer?)])

(define (fibonacci n)
  (cond [(= n 0) 0]
        [(= n 1) 1]
        [else (+ (fibonacci (- n 1))
                 (fibonacci (- n 2)))]))

;; Example usage
(define (run-examples)
  (displayln (format "Fibonacci of 10 (recursive): ~a" (fib-recursive 10)))
  (displayln (format "Fibonacci of 10 (memoized): ~a" (fib-memo 10)))
  (displayln (format "Fibonacci of 10 (contract): ~a" (fibonacci 10))))

(module+ main
  (run-examples))
#+END_SRC

** Factorial

#+BEGIN_SRC racket :tangle src/racket/factorial.rkt :mkdirp yes
#lang racket

;; Recursive implementation
(define (factorial-recursive n)
  (if (<= n 1)
      1
      (* n (factorial-recursive (- n 1)))))

;; Tail-recursive implementation
(define (factorial-tail n [acc 1])
  (if (<= n 1)
      acc
      (factorial-tail (- n 1) (* n acc))))

;; Implementation using fold
(define (factorial-fold n)
  (for/fold ([acc 1])
            ([i (in-range 1 (add1 n))])
    (* acc i)))

;; Example usage
(define (run-examples)
  (displayln (format "Factorial of 5 (recursive): ~a" (factorial-recursive 5)))
  (displayln (format "Factorial of 5 (tail): ~a" (factorial-tail 5)))
  (displayln (format "Factorial of 5 (fold): ~a" (factorial-fold 5))))

(module+ main
  (run-examples))
#+END_SRC

** Prime Number Generator

#+BEGIN_SRC racket :tangle src/racket/primes.rkt :mkdirp yes
#lang racket

;; Check if a number is prime
(define (prime? n)
  (and (> n 1)
       (let loop ([i 2])
         (or (> (sqr i) n)
             (and (not (zero? (remainder n i)))
                  (loop (add1 i)))))))

;; Generate primes up to n
(define (primes-up-to n)
  (for/list ([i (in-range 2 (add1 n))]
             #:when (prime? i))
    i))

;; Sieve of Eratosthenes
(define (sieve-of-eratosthenes n)
  (define sieve (make-vector (add1 n) #t))
  (vector-set! sieve 0 #f)
  (vector-set! sieve 1 #f)
  
  (for ([i (in-range 2 (add1 (exact-floor (sqrt n))))]
        #:when (vector-ref sieve i))
    (for ([j (in-range (sqr i) (add1 n) i)])
      (vector-set! sieve j #f)))
  
  (for/list ([i (in-range 2 (add1 n))]
             #:when (vector-ref sieve i))
    i))

;; Example usage
(define (run-examples)
  (displayln (format "Primes up to 20: ~a" (primes-up-to 20)))
  (displayln (format "Primes up to 20 (sieve): ~a" (sieve-of-eratosthenes 20)))
  (displayln (format "Is 17 prime? ~a" (prime? 17)))
  (displayln (format "Is 15 prime? ~a" (prime? 15))))

(module+ main
  (run-examples))
#+END_SRC

** FizzBuzz

#+BEGIN_SRC racket :tangle src/racket/fizzbuzz.rkt :mkdirp yes
#lang racket

;; FizzBuzz using cond
(define (fizzbuzz n)
  (for ([i (in-range 1 (add1 n))])
    (displayln
     (cond
       [(zero? (remainder i 15)) "FizzBuzz"]
       [(zero? (remainder i 3)) "Fizz"]
       [(zero? (remainder i 5)) "Buzz"]
       [else i]))))

;; FizzBuzz as a list using for/list
(define (fizzbuzz-list n)
  (for/list ([i (in-range 1 (add1 n))])
    (cond
      [(zero? (remainder i 15)) "FizzBuzz"]
      [(zero? (remainder i 3)) "Fizz"]
      [(zero? (remainder i 5)) "Buzz"]
      [else i])))

;; FizzBuzz using match
(define (fizzbuzz-match n)
  (for/list ([i (in-range 1 (add1 n))])
    (match (list (zero? (remainder i 3))
                (zero? (remainder i 5)))
      [(list #t #t) "FizzBuzz"]
      [(list #t #f) "Fizz"]
      [(list #f #t) "Buzz"]
      [_ i])))

;; Example usage
(define (run-examples)
  (displayln "FizzBuzz (1-20):")
  (fizzbuzz 20)
  (displayln (format "\nFizzBuzz as list (1-20): ~a" (fizzbuzz-list 20))))

(module+ main
  (run-examples))
#+END_SRC

** Quicksort

#+BEGIN_SRC racket :tangle src/racket/quicksort.rkt :mkdirp yes
#lang racket

;; Quicksort implementation using filter
(define (quicksort lst)
  (if (or (empty? lst) (empty? (rest lst)))
      lst
      (let ([pivot (first lst)]
            [rest (rest lst)])
        (append
         (quicksort (filter (λ (x) (< x pivot)) rest))
         (list pivot)
         (quicksort (filter (λ (x) (>= x pivot)) rest))))))

;; Quicksort using Racket's pattern matching
(define (quicksort-match lst)
  (match lst
    [(list) '()]
    [(list x) (list x)]
    [(cons pivot rest)
     (append
      (quicksort-match (filter (λ (x) (< x pivot)) rest))
      (list pivot)
      (quicksort-match (filter (λ (x) (>= x pivot)) rest)))]))

;; Quicksort using for/list
(define (quicksort-for lst)
  (if (or (empty? lst) (empty? (rest lst)))
      lst
      (let ([pivot (first lst)]
            [rest (rest lst)])
        (append
         (quicksort-for
          (for/list ([x rest] #:when (< x pivot)) x))
         (list pivot)
         (quicksort-for
          (for/list ([x rest] #:when (>= x pivot)) x))))))

;; Example usage
(define (run-examples)
  (let ([numbers '(3 1 4 1 5 9 2 6 5 3 5)])
    (displayln (format "Original list: ~a" numbers))
    (displayln (format "Quicksort: ~a" (quicksort numbers)))
    (displayln (format "Quicksort with match: ~a" (quicksort-match numbers)))
    (displayln (format "Quicksort with for/list: ~a" (quicksort-for numbers)))))

(module+ main
  (run-examples))
#+END_SRC

* Hy

** Fibonacci

#+BEGIN_SRC hy :tangle src/hy/fibonacci.hy :mkdirp yes
#!/usr/bin/env hy

;; Recursive implementation
(defn fib-recursive [n]
  (cond [(= n 0) 0]
        [(= n 1) 1]
        [True (+ (fib-recursive (- n 1))
                 (fib-recursive (- n 2)))]))

;; Using Python's functionality
(import functools)

(defn fib-memo [n]
  (with-decorator (functools.lru_cache)
    (defn fib [n]
      (if (< n 2)
          n
          (+ (fib (- n 1))
             (fib (- n 2))))))
  (fib n))

;; Generator-based implementation
(defn fib-seq [n]
  (setv a 0)
  (setv b 1)
  (for [_ (range n)]
    (yield a)
    (setv [a b] [(, b (+ a b))]))
  (yield a))

(defn fib-gen [n]
  (list (take (+ n 1) (fib-seq 1000)))[-1])

;; Example usage
(defn run-examples []
  (print f"Fibonacci of 10 (recursive): {(fib-recursive 10)}")
  (print f"Fibonacci of 10 (memoized): {(fib-memo 10)}")
  (print f"Fibonacci of 10 (generator): {(fib-gen 10)}")
  (print f"First 10 Fibonacci numbers: {(list (take 10 (fib-seq 20)))}")
  )

(when (= __name__ "__main__")
  (run-examples))
#+END_SRC

** Factorial

#+BEGIN_SRC hy :tangle src/hy/factorial.hy :mkdirp yes
#!/usr/bin/env hy

;; Recursive implementation
(defn factorial-recursive [n]
  (if (<= n 1)
      1
      (* n (factorial-recursive (- n 1)))))

;; Tail-recursive implementation
(defn factorial-tail [n &optional [acc 1]]
  (if (<= n 1)
      acc
      (factorial-tail (- n 1) (* n acc))))

;; Using Python's functionality
(import math)

(defn factorial-math [n]
  (math.factorial n))

;; Example usage
(defn run-examples []
  (print f"Factorial of 5 (recursive): {(factorial-recursive 5)}")
  (print f"Factorial of 5 (tail-recursive): {(factorial-tail 5)}")
  (print f"Factorial of 5 (math): {(factorial-math 5)}")
  )

(when (= __name__ "__main__")
  (run-examples))
#+END_SRC

** Prime Number Generator

#+BEGIN_SRC hy :tangle src/hy/primes.hy :mkdirp yes
#!/usr/bin/env hy

;; Check if a number is prime
(defn prime? [n]
  (when (> n 1)
    (setv limit (int (math.sqrt n)))
    (for [i (range 2 (+ limit 1))]
      (when (= (% n i) 0)
        (return False)))
    True))

;; Generate primes up to n
(defn primes-up-to [n]
  (lfor i (range 2 (+ n 1)) :if (prime? i) i))

;; Sieve of Eratosthenes
(defn sieve-of-eratosthenes [n]
  (setv sieve (* [True] (+ n 1)))
  (assoc sieve 0 False)
  (assoc sieve 1 False)
  
  (for [i (range 2 (+ (int (math.sqrt n)) 1))]
    (when (get sieve i)
      (for [j (range (* i i) (+ n 1) i)]
        (assoc sieve j False))))
  
  (lfor i (range 2 (+ n 1)) :if (get sieve i) i))

;; Example usage
(import math)

(defn run-examples []
  (print f"Primes up to 20: {(primes-up-to 20)}")
  (print f"Primes up to 20 (sieve): {(sieve-of-eratosthenes 20)}")
  (print f"Is 17 prime? {(prime? 17)}")
  (print f"Is 15 prime? {(prime? 15)}")
  )

(when (= __name__ "__main__")
  (run-examples))
#+END_SRC

** FizzBuzz

#+BEGIN_SRC hy :tangle src/hy/fizzbuzz.hy :mkdirp yes
#!/usr/bin/env hy

;; FizzBuzz implementation
(defn fizzbuzz [n]
  (for [i (range 1 (+ n 1))]
    (print (cond [(= (% i 15) 0) "FizzBuzz"]
                 [(= (% i 3) 0) "Fizz"]
                 [(= (% i 5) 0) "Buzz"]
                 [True i]))))

;; FizzBuzz returning a list
(defn fizzbuzz-list [n]
  (lfor i (range 1 (+ n 1))
        (cond [(= (% i 15) 0) "FizzBuzz"]
              [(= (% i 3) 0) "Fizz"]
              [(= (% i 5) 0) "Buzz"]
              [True i])))

;; Using Python list comprehension style
(defn fizzbuzz-comp [n]
  (lfor i (range 1 (+ n 1))
        (if (= (% i 15) 0) "FizzBuzz"
            (if (= (% i 3) 0) "Fizz"
                (if (= (% i 5) 0) "Buzz" i)))))

;; Example usage
(defn run-examples []
  (print "FizzBuzz (1-20):")
  (fizzbuzz 20)
  (print "\nFizzBuzz as list (1-20):")
  (print (fizzbuzz-list 20))
  )

(when (= __name__ "__main__")
  (run-examples))
#+END_SRC

** Quicksort

#+BEGIN_SRC hy :tangle src/hy/quicksort.hy :mkdirp yes
#!/usr/bin/env hy

;; Quicksort implementation
(defn quicksort [lst]
  (if (or (not lst) (= (len lst) 1))
      lst
      (let [pivot (first lst)
            rest (list (rest lst))]
        (+ (quicksort (lfor x rest :if (< x pivot) x))
           [pivot]
           (quicksort (lfor x rest :if (>= x pivot) x))))))

;; Quicksort using filter
(defn quicksort-filter [lst]
  (if (or (not lst) (= (len lst) 1))
      lst
      (let [pivot (first lst)
            rest (list (rest lst))]
        (+ (quicksort-filter (list (filter (fn [x] (< x pivot)) rest)))
           [pivot]
           (quicksort-filter (list (filter (fn [x] (>= x pivot)) rest)))))))

;; Example usage
(defn run-examples []
  (setv numbers [3 1 4 1 5 9 2 6 5 3 5])
  (print f"Original list: {numbers}")
  (print f"Sorted list: {(quicksort numbers)}")
  (print f"Sorted with filter: {(quicksort-filter numbers)}")
  )

(when (= __name__ "__main__")
  (run-examples))
#+END_SRC

* Fennel

** Fibonacci

#+BEGIN_SRC fennel :tangle src/fennel/fibonacci.fnl :mkdirp yes
;; Recursive implementation
(fn fib-recursive [n]
  (if (= n 0) 0
      (= n 1) 1
      (+ (fib-recursive (- n 1))
         (fib-recursive (- n 2)))))

;; Tail-recursive implementation
(fn fib-tail [n]
  (var [a b] [0 1])
  (for [_ 1 n]
    (set [a b] [b (+ a b)]))
  a)

;; Memoized implementation
(local memo {})

(fn fib-memo [n]
  (if (. memo n)
      (. memo n)
      (let [result (if (< n 2)
                       n
                       (+ (fib-memo (- n 1))
                          (fib-memo (- n 2))))]
        (tset memo n result)
        result)))

;; Example usage
(fn run-examples []
  (print (.. "Fibonacci of 10 (recursive): " (fib-recursive 10)))
  (print (.. "Fibonacci of 10 (tail-recursive): " (fib-tail 10)))
  (print (.. "Fibonacci of 10 (memoized): " (fib-memo 10))))

(run-examples)
#+END_SRC

