SETUP.org
** Factorial

#+BEGIN_SRC fennel :tangle src/fennel/factorial.fnl :mkdirp yes
;; Recursive implementation
(fn factorial-recursive [n]
  (if (<= n 1)
      1
      (* n (factorial-recursive (- n 1)))))

;; Tail-recursive implementation
(fn factorial-tail [n acc]
  (let [acc (or acc 1)]
    (if (<= n 1)
        acc
        (factorial-tail (- n 1) (* n acc)))))

;; Iterative implementation
(fn factorial-iterative [n]
  (var result 1)
  (for [i 1 n]
    (set result (* result i)))
  result)

;; Example usage
(fn run-examples []
  (print (.. "Factorial of 5 (recursive): " (factorial-recursive 5)))
  (print (.. "Factorial of 5 (tail-recursive): " (factorial-tail 5)))
  (print (.. "Factorial of 5 (iterative): " (factorial-iterative 5))))

(run-examples)
#+END_SRC

** Prime Number Generator

#+BEGIN_SRC fennel :tangle src/fennel/primes.fnl :mkdirp yes
;; Check if a number is prime
(fn is-prime? [n]
  (when (> n 1)
    (var prime? true)
    (let [limit (math.floor (math.sqrt n))]
      (for [i 2 limit 1]
        (when (= (% n i) 0)
          (set prime? false)
          (lua "break")))
      prime?)))

;; Generate primes up to n
(fn primes-up-to [n]
  (local result [])
  (for [i 2 n]
    (when (is-prime? i)
      (table.insert result i)))
  result)

;; Sieve of Eratosthenes
(fn sieve-of-eratosthenes [n]
  (local sieve [])
  ;; Initialize sieve
  (for [i 0 n]
    (tset sieve i true))
  
  ;; 0 and 1 are not prime
  (tset sieve 0 false)
  (tset sieve 1 false)
  
  ;; Mark multiples as non-prime
  (let [limit (math.floor (math.sqrt n))]
    (for [i 2 limit]
      (when (. sieve i)
        (var j (* i i))
        (while (<= j n)
          (tset sieve j false)
          (set j (+ j i))))))
  
  ;; Collect primes
  (local primes [])
  (for [i 2 n]
    (when (. sieve i)
      (table.insert primes i)))
  
  primes)

;; Example usage
(fn run-examples []
  (print "Primes up to 20:")
  (print (table.concat (primes-up-to 20) ", "))
  (print "\nPrimes up to 20 (sieve):")
  (print (table.concat (sieve-of-eratosthenes 20) ", "))
  (print (.. "Is 17 prime? " (if (is-prime? 17) "Yes" "No")))
  (print (.. "Is 15 prime? " (if (is-prime? 15) "Yes" "No"))))

(run-examples)
#+END_SRC

** FizzBuzz

#+BEGIN_SRC fennel :tangle src/fennel/fizzbuzz.fnl :mkdirp yes
;; FizzBuzz implementation
(fn fizzbuzz [n]
  (for [i 1 n]
    (print (if (= (% i 15) 0) "FizzBuzz"
               (= (% i 3) 0) "Fizz"
               (= (% i 5) 0) "Buzz"
               i))))

;; FizzBuzz returning a table
(fn fizzbuzz-table [n]
  (local result [])
  (for [i 1 n]
    (table.insert result
                 (if (= (% i 15) 0) "FizzBuzz"
                     (= (% i 3) 0) "Fizz"
                     (= (% i 5) 0) "Buzz"
                     i)))
  result)

;; Example usage
(fn run-examples []
  (print "FizzBuzz (1-20):")
  (fizzbuzz 20)
  (print "\nFizzBuzz as table (1-20):")
  (local result (fizzbuzz-table 20))
  (var output "")
  (each [i v (ipairs result)]
    (set output (.. output v " ")))
  (print output))

(run-examples)
#+END_SRC

** Quicksort

#+BEGIN_SRC fennel :tangle src/fennel/quicksort.fnl :mkdirp yes
;; Quicksort implementation
(fn quicksort [arr]
  (if (or (= (length arr) 0) (= (length arr) 1))
      arr
      (let [pivot (. arr 1)
            lesser []
            greater []]
        (for [i 2 (length arr)]
          (let [value (. arr i)]
            (if (< value pivot)
                (table.insert lesser value)
                (table.insert greater value))))
        (let [result (quicksort lesser)]
          (table.insert result pivot)
          (each [_ v (ipairs (quicksort greater))]
            (table.insert result v))
          result))))

;; Example usage
(fn run-examples []
  (local numbers [3 1 4 1 5 9 2 6 5 3 5])
  (print "Original list:")
  (print (table.concat numbers ", "))
  (print "\nSorted list:")
  (print (table.concat (quicksort numbers) ", ")))

(run-examples)
#+END_SRC

* Janet

** Fibonacci

#+BEGIN_SRC janet :tangle src/janet/fibonacci.janet :mkdirp yes
# Recursive implementation
(defn fib-recursive [n]
  (cond
    (= n 0) 0
    (= n 1) 1
    (+ (fib-recursive (- n 1))
       (fib-recursive (- n 2)))))

# Memoized implementation
(defn fib-memo [n]
  (def cache @{})
  (defn fib [n]
    (if (get cache n)
      (get cache n)
      (let [result (if (< n 2)
                     n
                     (+ (fib (- n 1))
                        (fib (- n 2))))]
        (put cache n result)
        result)))
  (fib n))

# Tail-recursive implementation
(defn fib-tail [n]
  (defn fib-iter [a b count]
    (if (= count 0)
        a
        (fib-iter b (+ a b) (- count 1))))
  (fib-iter 0 1 n))

# Example usage
(defn run-examples []
  (printf "Fibonacci of 10 (recursive): %d" (fib-recursive 10))
  (printf "Fibonacci of 10 (memoized): %d" (fib-memo 10))
  (printf "Fibonacci of 10 (tail-recursive): %d" (fib-tail 10)))

(run-examples)
#+END_SRC

** Factorial

#+BEGIN_SRC janet :tangle src/janet/factorial.janet :mkdirp yes
# Recursive implementation
(defn factorial-recursive [n]
  (if (<= n 1)
    1
    (* n (factorial-recursive (- n 1)))))

# Tail-recursive implementation
(defn factorial-tail [n &opt acc]
  (default acc 1)
  (if (<= n 1)
    acc
    (factorial-tail (- n 1) (* n acc))))

# Iterative implementation
(defn factorial-iterative [n]
  (var result 1)
  (for i 1 (+ n 1)
    (set result (* result i)))
  result)

# Example usage
(defn run-examples []
  (printf "Factorial of 5 (recursive): %d" (factorial-recursive 5))
  (printf "Factorial of 5 (tail-recursive): %d" (factorial-tail 5))
  (printf "Factorial of 5 (iterative): %d" (factorial-iterative 5)))

(run-examples)
#+END_SRC

** Prime Number Generator

#+BEGIN_SRC janet :tangle src/janet/primes.janet :mkdirp yes
# Check if a number is prime
(defn prime? [n]
  (when (> n 1)
    (var is-prime true)
    (def limit (math/sqrt n))
    (for i 2 (+ (math/floor limit) 1)
      (when (= (% n i) 0)
        (set is-prime false)
        (break)))
    is-prime))

# Generate primes up to n
(defn primes-up-to [n]
  (def result @[])
  (for i 2 (+ n 1)
    (when (prime? i)
      (array/push result i)))
  result)

# Sieve of Eratosthenes
(defn sieve-of-eratosthenes [n]
  (def sieve (array/new-filled (+ n 1) true))
  # 0 and 1 are not prime
  (put sieve 0 false)
  (put sieve 1 false)
  
  (def limit (math/sqrt n))
  (for i 2 (+ (math/floor limit) 1)
    (when (get sieve i)
      (var j (* i i))
      (while (<= j n)
        (put sieve j false)
        (set j (+ j i)))))
  
  (def primes @[])
  (for i 2 (+ n 1)
    (when (get sieve i)
      (array/push primes i)))
  
  primes)

# Example usage
(defn run-examples []
  (printf "Primes up to 20: %j" (primes-up-to 20))
  (printf "Primes up to 20 (sieve): %j" (sieve-of-eratosthenes 20))
  (printf "Is 17 prime? %s" (if (prime? 17) "Yes" "No"))
  (printf "Is 15 prime? %s" (if (prime? 15) "Yes" "No")))

(run-examples)
#+END_SRC

** FizzBuzz

#+BEGIN_SRC janet :tangle src/janet/fizzbuzz.janet :mkdirp yes
# FizzBuzz implementation
(defn fizzbuzz [n]
  (for i 1 (+ n 1)
    (print (cond
             (= (% i 15) 0) "FizzBuzz"
             (= (% i 3) 0) "Fizz"
             (= (% i 5) 0) "Buzz"
             i))))

# FizzBuzz returning an array
(defn fizzbuzz-array [n]
  (def result @[])
  (for i 1 (+ n 1)
    (array/push result 
                (cond
                  (= (% i 15) 0) "FizzBuzz"
                  (= (% i 3) 0) "Fizz"
                  (= (% i 5) 0) "Buzz"
                  i)))
  result)

# Example usage
(defn run-examples []
  (print "FizzBuzz (1-20):")
  (fizzbuzz 20)
  (print "\nFizzBuzz as array (1-20):")
  (printf "%j" (fizzbuzz-array 20)))

(run-examples)
#+END_SRC

** Quicksort

#+BEGIN_SRC janet :tangle src/janet/quicksort.janet :mkdirp yes
# Quicksort implementation
(defn quicksort [arr]
  (if (or (= (length arr) 0) (= (length arr) 1))
    arr
    (let [pivot (first arr)
          rest (array/slice arr 1)
          lesser (filter |(< $ pivot) rest)
          greater (filter |(>= $ pivot) rest)]
      (array/concat (quicksort lesser) @[pivot] (quicksort greater)))))

# Example usage
(defn run-examples []
  (def numbers @[3 1 4 1 5 9 2 6 5 3 5])
  (printf "Original array: %j" numbers)
  (printf "Sorted array: %j" (quicksort numbers)))

(run-examples)
#+END_SRC
* Running Examples

** Common Lisp
#+BEGIN_SRC shell :tangle scripts/run-common-lisp.sh :mkdirp yes
#!/bin/sh
sbcl --load src/common-lisp/fibonacci.lisp --eval '(cl-fibonacci:run-examples)' --quit
sbcl --load src/common-lisp/factorial.lisp --eval '(cl-factorial:run-examples)' --quit
sbcl --load src/common-lisp/primes.lisp --eval '(cl-primes:run-examples)' --quit
sbcl --load src/common-lisp/fizzbuzz.lisp --eval '(cl-fizzbuzz:run-examples)' --quit
sbcl --load src/common-lisp/quicksort.lisp --eval '(cl-quicksort:run-examples)' --quit
#+END_SRC

** Clojure
#+BEGIN_SRC shell :tangle scripts/run-clojure.sh :mkdirp yes
#!/bin/sh
clj -M src/clojure/fibonacci.clj
clj -M src/clojure/factorial.clj
clj -M src/clojure/primes.clj
clj -M src/clojure/fizzbuzz.clj
clj -M src/clojure/quicksort.clj
#+END_SRC

** Scheme
#+BEGIN_SRC shell :tangle scripts/run-scheme.sh :mkdirp yes
#!/bin/sh
# Using Guile
guile src/scheme/fibonacci.scm
guile src/scheme/factorial.scm
guile src/scheme/primes.scm
guile src/scheme/fizzbuzz.scm
guile src/scheme/quicksort.scm
#+END_SRC

** Emacs Lisp
#+BEGIN_SRC shell :tangle scripts/run-emacs-lisp.sh :mkdirp yes
#!/bin/sh
emacs --batch \
  --load src/emacs-lisp/fibonacci.el \
  --load src/emacs-lisp/factorial.el \
  --load src/emacs-lisp/primes.el \
  --load src/emacs-lisp/fizzbuzz.el \
  --load src/emacs-lisp/quicksort.el \
  --eval "(progn (run-fibonacci-examples) (run-factorial-examples) (run-prime-examples) (run-fizzbuzz-examples) (run-quicksort-examples))"
#+END_SRC

** Racket
#+BEGIN_SRC shell :tangle scripts/run-racket.sh :mkdirp yes
#!/bin/sh
racket src/racket/fibonacci.rkt
racket src/racket/factorial.rkt
racket src/racket/primes.rkt
racket src/racket/fizzbuzz.rkt
racket src/racket/quicksort.rkt
#+END_SRC

** Hy
#+BEGIN_SRC shell :tangle scripts/run-hy.sh :mkdirp yes
#!/bin/sh
hy src/hy/fibonacci.hy
hy src/hy/factorial.hy
hy src/hy/primes.hy
hy src/hy/fizzbuzz.hy
hy src/hy/quicksort.hy
#+END_SRC

** Fennel
#+BEGIN_SRC shell :tangle scripts/run-fennel.sh :mkdirp yes
#!/bin/sh
fennel src/fennel/fibonacci.fnl
fennel src/fennel/factorial.fnl
fennel src/fennel/primes.fnl
fennel src/fennel/fizzbuzz.fnl
fennel src/fennel/quicksort.fnl
#+END_SRC

** Janet
#+BEGIN_SRC shell :tangle scripts/run-janet.sh :mkdirp yes
#!/bin/sh
janet src/janet/fibonacci.janet
janet src/janet/factorial.janet
janet src/janet/primes.janet
janet src/janet/fizzbuzz.janet
janet src/janet/quicksort.janet
#+END_SRC

* Benchmarks

#+BEGIN_SRC shell :tangle scripts/benchmark.sh :mkdirp yes :shebang #!/usr/bin/env bash
# Benchmark the Fibonacci implementations

echo "Benchmarking Fibonacci (n=30):"
echo "=============================="

# Common Lisp
echo "Common Lisp:"
time sbcl --noinform --eval "(defun fib (n) (if (< n 2) n (+ (fib (- n 1)) (fib (- n 2)))))" \
          --eval "(time (fib 30))" --eval "(quit)" 2>&1 | grep "Evaluation took"

# Clojure
echo "Clojure:"
time clojure -e "(defn fib [n] (if (< n 2) n (+ (fib (- n 1)) (fib (- n 2))))) (time (fib 30))"

# Scheme (Guile)
echo "Scheme (Guile):"
time guile -c "(define (fib n) (if (< n 2) n (+ (fib (- n 1)) (fib (- n 2))))) (fib 30)"

# Emacs Lisp
echo "Emacs Lisp:"
time emacs --batch --eval "(defun fib (n) (if (< n 2) n (+ (fib (- n 1)) (fib (- n 2))))) (fib 30)"

# Racket
echo "Racket:"
time racket -e "(define (fib n) (if (< n 2) n (+ (fib (- n 1)) (fib (- n 2))))) (fib 30)"

# Hy
echo "Hy:"
time hy -c "(defn fib [n] (if (< n 2) n (+ (fib (- n 1)) (fib (- n 2))))) (fib 30)"

# Fennel
echo "Fennel:"
time fennel -e "(fn fib [n] (if (< n 2) n (+ (fib (- n 1)) (fib (- n 2))))) (fib 30)"

# Janet
echo "Janet:"
time janet -e "(defn fib [n] (if (< n 2) n (+ (fib (- n 1)) (fib (- n 2))))) (fib 30)"
#+END_SRC

* Mermaid Diagram Example

This section shows how to use mermaid diagrams with the lisp-dialect showcase.

#+BEGIN_SRC mermaid :file images/lisp-family-tree.png :tangle docs/lisp-family-tree.mmd :mkdirp yes
graph TD
    Lisp[Lisp 1.5<br>1958] --> CommonLisp[Common Lisp<br>1984]
    Lisp --> Scheme[Scheme<br>1975]
    Lisp --> InterLisp[InterLisp<br>1967]
    Lisp --> MacLisp[MacLisp<br>1966]
    
    MacLisp --> ZetaLisp[ZetaLisp<br>1978]
    MacLisp --> CommonLisp
    ZetaLisp --> CommonLisp
    
    Scheme --> Racket[Racket<br>1995]
    CommonLisp --> EmacLisp[Emacs Lisp<br>1985]
    
    Scheme --> Clojure[Clojure<br>2007]
    
    Clojure --> Hy[Hy<br>2013]
    
    Lisp --> NewLisp[NewLisp<br>1991]
    Lisp --> Fennel[Fennel<br>2016]
    Lisp --> Janet[Janet<br>2017]
    
    style Lisp fill:#f9f,stroke:#333,stroke-width:4px
    style CommonLisp fill:#bbf,stroke:#333,stroke-width:4px
    style Scheme fill:#bfb,stroke:#333,stroke-width:4px
    style Clojure fill:#bbf,stroke:#333,stroke-width:3px
    style Racket fill:#fbf,stroke:#333,stroke-width:3px
    style EmacLisp fill:#fbf,stroke:#333,stroke-width:3px
    style Hy fill:#fbb,stroke:#333,stroke-width:2px
    style Fennel fill:#bff,stroke:#333,stroke-width:2px
    style Janet fill:#ffb,stroke:#333,stroke-width:2px
#+END_SRC
